Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དོང་དེ་ཅི་བྱ་ཞེས་དྲི་ཡིས།
en: I ask what that hole is for.

source: །མྱུར་དུ་ང་ལ་སྨྲ་བར་གྱིས།
en: Tell me quickly.’

source: །ཁ་ལོ་སྒྱུར་བས་སྨྲས་པ།
en: “The charioteer answered:

source: རྒྱལ་པོའི་སྲས་པོ་བཙས་པ་ནི།
en: “ ‘The son born to the king

source: །ཞ་བོ་ལྐུགས་པ་སྨྲ་མི་ཤེས།
en: Is lame and mute, knowing no words.

source: །དེས་འདི་ཚལ་ཁྲོད་མྱུར་དུ་ནི།
en: Therefore, it was ordered to dig a hole quickly

source: །དོང་རྐོས་ཆུག་ཅེས་བཀའ་སྩལ་ཏོ།
en: And bury him in the forest.’

source: །དེ་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་དག་ནི་གདུག་པ། ལག་དམར་བ། གསོད་པ་དང་། གཅོད་པ་ལ་ཆགས་པ།
en: “Then Prince Mūkapaṅgu thought, ‘These people are evil:

source: གཞན་གྱི་སྲོག་འཕྲོག་པ། ཕ་རོལ་གྱི་སྲོག་གཅོད་པས་འཚོ་བར་བྱེད་པ་ཡིན་ནོ་སྙམ་ནས། དེ་འཇིགས་ཤིང་བརྒྱ་ལ་ན་འདི་དག་གིས་བདག་གསད་པར་འགྱུར་རོ། །སྙམ་དུ་རིག་ནས་གཤེད་མ་པ་རྣམས་ལ་སྨྲས་པ། ལྷས་གལ་ཏེ་བདག་ལ་མཆོག་ཅིག་གནང་ན་བདག་རྐང་གིས་གྲོང་ཁྱེར་དུ་འཇུག་ཅིང་ཚིག་ཀྱང་སྨྲའོ།
en: ones with bloody hands, ones attached to killing and murder, ones who take others’ lives, ones who make their living by destroying others’ lives.’ Fearful, he felt faint and thought, ‘These people will kill me.’ He said to the executioners, ‘If His Majesty bestows the most excellent thing on me, I will enter the city on foot and even speak words.’

source: །གཤེད་མ་པའི་མི་རྣམས་ཀྱིས་རྒྱལ་པོའི་དྲུང་དུ་སོང་ནས་རྒྱས་པར་སྨྲས་པ་དང་། རྒྱལ་པོས་སྨྲས་པ།
en: “The executioners went to the king and reported this in detail.

source: གལ་ཏེ་གཞོན་ནུ་རྒྱལ་སྲིད་འདོད་ན་ཡང་ངས་དེ་ཡང་གཞོན་ནུ་ལ་སྦྱིན་བར་བྱའོ།
en: The king said, ‘If the prince wants the throne, I will give it to him.’

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་ཡིད་དགའ་ཞིང་། ཡིད་དགའ་ནས། བློན་པོ་རྣམས་ལ་བསྒོ་བ། ཤེས་ལྡན་དག་དེང་ལ་གྲོང་ཁྱེར་ཐམས་ཅད་རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་རྣམས་མྱུར་དུ་སོལ་ལ་པོག་གི་དུད་པ་དང་ཕྱེ་མས་འཁྲིགས་པར་བྱོས་ཏེ་རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་ལ།
en: “Then, much delighted, King Brahmadatta ordered his ministers, ‘Sirs, quickly remove the stones, pebbles, and gravel from the whole city and cover it with a cloud of incense and powder today.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སིལ་མ་ཁྲོམ་ཤིག་ཅེས་བསྒོའོ།
en: Raise banners and flags and scatter petals of various flowers.’

source: །ས་བདག་རྣམས་ནི་ཚིག་གིས་འགྲུབ་ལ།
en: (Masters of the earth accomplish things by their words;

source: ལྷ་རྣམས་དང་། རྣལ་འབྱོར་པ་རྣམས་ནི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཐམས་ཅད་འགྲུབ་ཅེས་བྱ་བས་ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་བློན་པོ་རྣམས་ཀྱིས་རྒྱལ་པོ་ལས་མཉན་ནས་གྲོང་ཁྱེར་ཐམས་ཅད་རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་རྣམས་བསལ་ཅིང་། པོག་གི་དུད་པ་དང་ཕྱེ་མས་འཁྲིགས་པར་བྱས་ནས་རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་སྟེ། མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སིལ་མ་བཀྲམ་མོ།
en: gods and meditators accomplish everything as soon as they think of it.) “ ‘Certainly, Your Majesty,’ replied the ministers, and they quickly removed the stones, pebbles, and gravel from the whole city, covered it with a cloud of incense and powder, raised banners and flags and scattered petals of various flowers.

source: །གཞོན་ནུ་ལྐུགས་འཕྱེ་རྐང་པས་གྲོང་ཁྱེར་དུ་འཇུག་པ་ན་ཡ་མཚན་སྐྱེས་པའི་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་ཀྱང་འདུས་སོ།
en: “When Prince Mūkapaṅgu entered the city on foot, hundreds of thousands of beings gathered, prompted by curiosity.

source: །དེ་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེས་རྐང་གིས་གྲོང་ཁྱེར་དུ་ཞུགས་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ཚངས་སྦྱིན་གྱི་རྐང་པ་གཉིས་ལ་གཏུགས་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: After entering the city on foot, Prince Mūkapaṅgu went to King Brahmadatta. When he arrived, he threw himself at the feet of King Brahmadatta and then spoke a verse:

source: མི་དབང་བདག་ནི་ལྐུགས་འཕྱེ་དང་། །བླུན་པོ་བློ་མི་ལྡན་མ་ལགས།
en: “ ‘O king of the people, I am not mute, lame, Foolish, or stupid.

source: །རྣམ་པར་གསལ་བར་བགྱིད་པ་ཡི།
en: I speak clearly

source: །ཚིག་གིས་གསལ་བར་བགྱིད་པ་ལགས།
en: With clear words.

source: །མི་དབང་བདག་ནི་ལྐུགས་འཕྱེ་དང་། །བླུན་པོ་བློ་མི་ལྡན་མ་ལགས།
en: “ ‘O king of the people, I am not mute, lame, Foolish, or stupid. I am endowed with

source: །དབང་པོ་རྣམས་ནི་ཚང་བ་དང་། །གསལ་བ་དག་དང་ལྡན་པ་ལགས།
en: Complete and keen faculties.’

source: །རྒྱལ་པོས་སྨྲས་པ། བུ་ཅིའི་ཕྱིར་ཚིག་མི་འབྱིན་ཅིང་རྐང་གིས་མི་འགྲོ།
en: “The king asked, ‘Son, why did you neither utter any word nor walk on foot?’

source: ལྷ་དེའི་སླད་ནས་གསོན་ཅིག །བདག་གིས་སྔོན་གྱི་ཚེ་རབས་དྲན།
en: “ ‘Your Majesty, please listen: “ ‘I remember a past time.

source: །ལོ་ནི་དྲུག་བཅུའི་བར་དག་ཏུ།
en: For sixty years,

source: །མི་ཡི་ནང་དུ་རིགས་བརྒྱུད་པའི།
en: I performed, among the people, the duties of

source: །རྒྱལ་ཚབ་བདག་གིས་བགྱིས་པ་གང་།
en: A crown prince of the family lineage. This matured in an intolerable way—

source: །ལོ་ནི་དྲུག་ཁྲིའི་བར་དག་ཏུ།
en: In hell for sixty thousand years.

source: །དམྱལ་བའི་ནང་དུ་མི་བཟད་སྨིན།
en: “ ‘If I go to hell again,

source: །དམྱལ་བའི་སྡུག་བསྔལ་མི་བཟད་པ། །དྲག་པོ་འཇིགས་བྱེད་དེ་དྲན་ནས།
en: Remembering the dreadful, intolerable pain of hell,

source: །དམྱལ་བར་ཡང་མཆི་མི་རུང་བས།
en: It would not be right.

source: །རྒྱལ་སྲིད་ལ་ནི་མངོན་མི་དགའ།
en: Thus I am not pleased with the throne.

source: །ཡབ་གཅིག་གནང་བར་མཛོད་ཅིག་དང་། །ད་ནི་རབ་ཏུ་དབྱུང་བར་བགྱི།
en: Father, please allow me To go forth now.’

source: །རྒྱལ་པོས་སྨྲས་པ། བུ་དྲང་སྲོང་རྣམས་ཀྱིས་གང་དཀའ་ཐུབ་ཅུང་ཟད་ཅི་བྱས་པ་དང་། མཆོད་སྦྱིན་དང་སྦྱིན་སྲེག་ཅི་བྱས་པ་དེ་དག་ཐམས་ཅད་ནི་རྒྱལ་སྲིད་ཀྱི་ཕྱིར་ཡིན་ན་ཁྱོད་ཅིའི་ཕྱིར་རྒྱལ་སྲིད་ལག་མཐིལ་དུ་འོངས་པ་སྤངས་ཏེ་རབ་ཏུ་འབྱུང་།
en: “ ‘Son,’ said the king, ‘it is all for the throne that ṛṣis engage in ascetic practices, make offerings, and perform fire offerings. Why would you abandon the throne that is in your hands to go forth?’

source: དེ་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཀིམ་པའི་འབྲས་བུ་འདྲ་བ་ཡི།
en: “Then Prince Mūkapaṅgu spoke a verse:

source: །འདོད་པ་རྣམས་ལ་སྤྱོད་མི་འཚལ།
en: “ ‘I do not wish to enjoy the objects of desire,

source: །བདུད་རྩིའི་འབྲས་བུའི་རོ་ལྟ་བུའི།
en: Which are like the fruit of the kimpāka.

source: །ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱི།
en: I will enjoy the pure life, Which tastes like the fruit of amṛta.’

source: །རྒྱལ་པོས་སྨྲས་པ། བུ་བདེ་བ་གང་ཅི་ཉམས་སུ་མྱོང་བ་དེ་ཐམས་ཅད་རྒྱལ་སྲིད་ཀྱི་ཡིན་ན།
en: “ ‘Son,’ the king insisted, ‘all kinds of happiness to be experienced belong to the throne.

source: ཅིའི་ཕྱིར་ཁྱོད་རྒྱལ་སྲིད་ཀྱི་བདེ་བ་སྤངས་ཏེ་རབ་ཏུ་འབྱུང་།
en: Why would you abandon the happiness of the throne to go forth?’

source: གཞོན་ནུ་ལྐུགས་འཕྱེས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། གང་ལས་སྡུག་བསྔལ་རབ་འབྱུང་བའི།
en: “Prince Mūkapaṅgu then spoke a verse:

source: །བདེ་དེ་བདེའོ་སྙམ་མི་བགྱིད།
en: “ ‘I do not regard such “happiness”

source: །གང་ལས་བདེ་བ་རབ་སྐྱེ་བའི།
en: That produces suffering as happiness.

source: །སྡུག་བསྔལ་སྡུག་བསྔལ་སྙམ་མི་བགྱིད།
en: I do not regard such “suffering” That generates happiness as suffering.

source: །ཡབ་གཅིག་བདག་ལ་གནང་བར་མཛོད།
en: Father, please allow me

source: །དཀའ་ཐུབ་ནགས་སུ་མཆི་བར་བགྱི།
en: To go to the forest of ascetics.’

source: །རྒྱལ་པོས་སྨྲས་པ། བུ་རེ་ཞིག་ཁང་བཟངས་ཀྱི་གཞི་པོག་གི་དུད་པ་དང་ཕྱེ་མས་འཁྲིགས་པ་དང་། མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་པར་མལ་འཇམ་པོ་སྟེང་གཡོགས་བཟང་པོ་ཅན་བཤམས་ལ་གང་ནས་ཀྱང་འཇིགས་པ་མེད་པར་ནི་ཉལ།
en: “The king said, ‘Son, for now, you should lie without fear of anything on the terrace covered with a cloud of incense and powder, where various flowers are scattered and a soft bed with a beautiful canopy has been installed.

source: རོལ་མོའི་སྒྲ་སྙན་པས་ནི་སད། གོས་འཇམ་པོ་ནི་བགོ། ཟས་ཞིམ་པོ་ནི་ཟ། བཏུང་བ་ཞིམ་པོ་ནི་བཏུང་བར་བྱའོ།
en: Appreciate the pleasant sound of music, wear soft clothes, eat tasty food, and drink tasty drinks.

source: །དགོན་པར་ནི་རབ་ཏུ་བྱུང་བས་རྟག་ཏུ་ཤིང་དྲུང་དུ་རྩྭའི་གདིང་བ་དང་། ལོ་མའི་གདིང་བ་ལ་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཀྱིས་གཅན་གཟན་གདུག་པ་རྣམས་དང་ལྷན་ཅིག་ཉལ། ཅེ་སྤྱང་གི་སྒྲས་ནི་སད། གཡང་གཞི་དང་། ཤིང་ཤུན་གྱི་གོས་ནི་གྱོན། རྩ་བ་དང་། འབྲས་བུ་ནི་ཟ། ཆུ་དྲོན་པོ་དང་། ཆུ་རྙོག་པ་ཅན་གྱི་བཏུང་བ་ནི་བཏུང་དགོས་ན་ཁྱོད་ཅིའི་ཕྱིར་རྒྱལ་སྲིད་སྤངས་ཏེ་རབ་ཏུ་འབྱུང་།
en: If going forth in the wilderness requires you to lie always on a bed of grass or a bed of leaves under a tree, afraid and uneasy, with dangerous beasts all around—to be frightened by jackals barking, to wear a garment of antelope skin and bark, to eat roots and fruits, and to drink unpleasantly warm and dangerous water—why would you abandon the throne and go forth?’

source: དེ་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then Prince Mūkapaṅgu spoke a verse:

source: ནགས་ན་ཤིང་ཤུན་གཡང་གཞི་གྱོན་ཞིང་འབྲས་བུ་ཟ།
en: “ ‘It is better to wear bark and antelope skin, eat fruits,

source: །གཅན་གཟན་གདུག་པ་རྣམས་དང་ལྷན་ཅིག་འདུག་པ་བླའི།
en: And be with dangerous beasts in the forest.

source: །མཁས་པ་འཇིག་རྟེན་ཕ་རོལ་དག་གིས་འཇིགས་པ་ཡིས།
en: It is not right for a wise man who is anxious about the next life

source: །རྒྱལ་སྲིད་ཕྱིར་ནི་གསོད་དང་རྡེག་དང་འཆིང་མི་རུང་།
en: To kill, hit, and bind others for the sake of the throne.

source: །རྒྱལ་པོས་སྨྲས་པ། བུ་རེ་ཞིག་ངའི་ཐེ་ཚོམ་གསུམ་པོ་འདི་དག་ཆོད་ཅིག་དང་དེའི་འོག་ཏུ་ཁྱོད་རབ་ཏུ་འབྱུང་བ་མི་དཀའ་བར་འགྱུར་རོ།
en: “ ‘Son,’ the king persisted, ‘for the time being, clarify these three questions of mine. It will not be difficult for you to go forth after that.

source: །གང་ཁྱོད་ཀྱིས་བཱ་རཱ་ཎ་སཱིའི་འབྱོར་ཅིང་རྒྱས་པ་མཐོང་ནས། བཱ་རཱ་ཎ་སཱི་འདི་ཅི་སྟོང་པ་ཡིན་ནམ།
en: When you saw Vārāṇasī’s riches and prosperity, you said, “Is this Vārāṇasī empty?

source: འོན་ཏེ་གནས་པ་ཞིག་ཡོད་ཅེས་སྨྲས་པ། དེ་ཁྱོད་ཀྱིས་ཅི་ཞིག་ལས་བསམས་ཏེ་སྨྲས།
en: Or is there anyone living here?” What were you thinking when you said this?’

source: ལྷ་དེའི་སླད་དུ་གསོན་ཅིག །ལྷས་བདག་ནོངས་པ་མ་མཆིས་པར་འགུམ་པར་བཀའ་སྩལ་པ།
en: “ ‘Your Majesty, please listen. When Your Majesty said that I would die while I was blameless, nobody spoke the appropriate words:

source: འགས་ཀྱང་གཞོན་ནུ་འདི་ཅིའི་ཕྱིར་གསད་ཅེས་ཆོས་ཀྱི་ཚིག་མ་སྨྲས་པ་དེ་ལས་བསམས་ཏེ་བདག་གིས་སྨྲས་ལགས་སོ། །བཟང་ངོ་།
en: “Why will the prince be killed?” Thus thinking, I said that.’ “ ‘Good.

source: །གང་ཁྱོད་ཀྱིས་མི་རོ་མཐོང་ནས་ཅི་འདི་ཤི་བ་ཉིད་ཤིའམ།
en: When you saw a dead person, you said, “Did someone dead die?

source: འོན་ཏེ་གསོན་པོ་ཤི་ཞེས་སྨྲས་པ་དེ་ཅི་ལས་བསམས་ཏེ་སྨྲས།
en: Or did someone living die?” What were you thinking when you said this?’

source: ལྷ་དེའི་སླད་དུ་གསོན་ཅིག །གང་ཞིག་ཉེས་པར་བགྱིད་པའི་ལས་བགྱིད་བགྱིད་ནས་གུམ་པ་དེ་ནི་གུམ་པ་ཉིད་གུམ་པ་ལགས་ལ་གང་ཞིག་ལེགས་པར་བགྱིད་པའི་ལས་བགྱིད་བགྱིད་པ་དེ་གུམ་པ་དེ་ནི་གསོན་པ་གུམ་པ་ལགས་པ་དེ་ལས་བསམས་ནས་བདག་གིས་སྨྲས་ལགས་སོ། །བཟང་ངོ་།
en: “ ‘Your Majesty, please listen. Those who die after performing evil acts die as the dead; those who die after performing good acts die as the living. Thus thinking, I said that.’ “ ‘Good.

source: །གང་ཁྱོད་ཀྱིས་འབྲས་ཀྱི་ཕུང་པོ་ཆེན་པོ་མཐོང་ནས། འབྲས་ཀྱི་ཕུང་པོ་ཆེན་པོ་འདི་དང་པོ་ཉིད་ནས་མ་ཟོས་དང་དྲུང་ཟུག་པར་འགྱུར་བ་ཞིག་ཅེས་སྨྲས་པ་དེ་ཅི་ལས་བསམས་ཏེ་སྨྲས།
en: When you saw a large heap of rice, you said, “If it had not been eaten first, the root of this large heap of rice would have been well settled.” What were you thinking when you said this?’

source: ལྷ་དེའི་སླད་དུ་གསོན་ཅིག །ཞིང་པ་འདི་རྣམས་ཀྱིས་འབྲས་བུན་བླངས་ཏེ་འཚལ་ནས་ལས་བགྱིད་ཅིང་།
en: “ ‘Your Majesty, please listen. The peasants borrow rice, eat it, and do their work.

source: དེ་དག་ལོ་ཐོག་སྨིན་ནས་འབྲས་ཀྱི་ཕུང་པོ་ཆེན་པོ་བཅེར་ནས་བུ་ལོན་པ་རྣམས་ལ་འཇལ་ཏེ།
en: After the crops have matured and they have made a large heap of rice, they return the rice to the lender.

source: དེ་ལྟར་ན་དེ་དག་གི་དྲུང་དེ་ནི་སྔ་ནས་འཚལ་བ་ཉིད་ལགས་སོ།
en: If that is so, the root of these crops has been eaten before.

source: །དེ་བཞིན་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱིས་མི་ཉིད་ཐོབ་ལ་དེ་ཐོབ་ནས་དགེ་བའི་ལས་ཀྱི་ལམ་མི་སོགས་ན་དེ་ལྟ་ན་དེའི་སྔོན་གྱི་དགེ་བ་དེ་རྒྱུན་ཆད་པར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་དེ་རྒྱུན་ཆད་ན་བདེ་འགྲོ་ལས་ཉམས་ཤིང་ངན་འགྲོར་གནས་པར་འགྱུར་བ་དེ་ལས་བསམས་ནས་བདག་གིས་སྨྲས་ལགས་སོ།
en: In the same way, after one attains a human life by the ten kinds of good acts, if the good acts do not increase, one’s previous good acts will be exhausted, and if the roots of the good acts are exhausted, one will fall from that happy life and live in an inferior state of existence. Thus thinking, I said that.’

source: །དེ་ནས་རྒྱལ་པོས་བུའི་ཚིག་ཐོས་ནས་མཆི་མས་བརྣངས་བཞིན་བུ་ལ་འཁྱུད་དེ་སྨྲས་པ།
en: “Hearing his son’s words, and choking with tears, the king embraced him and said:

source: བརྟུལ་ཞུགས་ངེས་ལོང་རང་གི་ཆོས་སྤྱོད་ཅིག །བདག་ཀྱང་ཁྱོད་ཀྱི་སློབ་མར་ཁས་བླང་ངོ་།
en: “ ‘Accept the steadfast vow and perform your own Dharma. I too will promise to become your disciple.’

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གྱིས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་གལ་ཏེ་གཞོན་ནུ་ལྐུགས་འཕྱེ་རབ་ཏུ་མ་བྱུང་ན་ཅིར་འགྱུར།
en: “Then King Brahmadatta asked the ministers, ‘Sirs, if Prince Mūkapaṅgu does not go forth, what will he become?’

source: ལྷ་རྒྱལ་པོར་འགྱུར་རོ།
en: “ ‘Your Majesty, he will become the king.’

source: །ཁྱོད་ཅག་གི་བུ་རྣམས་ཅིར་འགྱུར།
en: “ ‘What will your sons become?’

source: ལྷ་དེའི་གཡོག་ཏུ་འགྱུར་རོ།
en: “ ‘Your Majesty, they will become his attendants.’

source: །དེ་རབ་ཏུ་འབྱུང་ན་ཁྱེད་ཅག་གི་བུ་རྣམས་ཅིའི་ཕྱིར་རབ་ཏུ་མི་འབྱུང་། ལྷ་བཀའ་ཅི་སྩལ་དུ་བས་སོ།
en: “ ‘If he goes forth, why would your sons not go forth?’ “ ‘Your Majesty, we will follow your orders.’

source: །དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་དང་ཧ་ཅང་ཡང་མི་རིང་བའི་བསྟི་གནས་ཞིག་ཡོད་དེ། དེ་ན་དྲང་སྲོང་བྱམས་པའི་བདག་ཉིད་སྙིང་རྗེ་ཅན་སྙིང་བརྩེ་བ། སེམས་ཅན་ཐམས་ཅད་ལའོ་བྱམས་པ་ཞིག་གནས་སོ།
en: “At that time, there was a hermitage near Vārāṇasī, and there lived a brahmin who was naturally loving and merciful, had compassion, and loved every living being.

source: །དེ་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེ་འཁོར་ལྔ་བརྒྱ་དང་འབྱོར་པ་ཆེན་པོས་དྲང་སྲོང་དེ་ལས་རབ་ཏུ་བྱུང་ནས་དེས་དེ་ལ་གདམས་ངག་བྱིན་ཏེ།
en: Prince Mūkapaṅgu then went forth with great majesty with his five hundred attendants in the presence of that ṛṣi.

source: དེས་འབད་པ་དང་། བརྩལ་བ་དང་། བརྩོན་འགྲུས་དྲག་པོས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ། །དེ་ནས་དུས་གཞན་ཞིག་ན་དྲང་སྲོང་དེ་དུས་ཀྱི་ཆོས་དང་ལྡན་པར་གྱུར་ནས་གཞོན་ནུ་ལྐུགས་འཕྱེས་དྲང་སྲོང་དེའི་རོ་དྲི་སྣ་ཚོགས་ཀྱི་ཤིང་ཕུང་པོར་སྤུངས་ནས། བསྲེགས་ཏེ་མཆོད་པ་དང་བཀུར་སྟི་ཆེར་བྱས་སོ།
en: The ṛṣi imparted teachings to him, and thereafter, through effort, exertion, and vigor, he actualized the five kinds of supernormal knowledge. “Later, the ṛṣi passed away. Prince Mūkapaṅgu heaped up various kinds of fragrant wood, cremated the ṛṣi’s body, and performed a great offering and ceremony for him.

source: །གཞོན་ནུ་ལྐུགས་འཕྱེས་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ལ་གདམས་ངག་བྱིན་ནས། དེ་རྣམས་ཀྱིས་འབད་པ་དང་། བརྩལ་བ་དང་། བརྩོན་འགྲུས་དྲག་པོས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: Then Prince Mūkapaṅgu imparted teachings to the five hundred young brahmins, and, through effort, exertion, and vigor, they too actualized the five kinds of supernormal knowledge.”

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་གཞོན་ནུ་ལྐུགས་འཕྱེ་རྒྱལ་སྲིད་ལག་མཐིལ་དུ་འོངས་པ་ཡོངས་སུ་སྤངས་ཏེ། བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་དང་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: It was me who was Prince Mūkapaṅgu at that time, on that occasion, who abandoned the throne that was in my hands, and actualized the five kinds of supernormal knowledge.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་བྱས་པ་དང་། རྒྱལ་སྲིད་སྤངས་པ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening because I benefited all the beings there and abandoned the throne, you should think otherwise;

source: འོན་ཀྱང་ངས་སེམས་ཅན་ལ་ཕན་པ་བྱས་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: that I benefited beings was only a cause, only a condition, only a preparation for supreme and complete awakening.” 5.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་རི་དགས་དང་བྱའི་ཚོགས་མེའི་འཇིགས་པ་ལས་ཐར་པར་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་ནགས་ཚལ་སྟུག་པོ་རི་དང་ཆུ་དང་། རྩྭ་སྔོན་པོ་དང་། གེལ་པ་དང་། ཤིང་སཱ་ལ་དང་པ་ལ་ཤ་རྣམས་ཀྱིས་མཛེས་པར་བྱས་པ་ཞིག་གི་ཚལ་གསེབ་ན་བྱའི་ཚོགས་ཆེན་པོ་ཞིག་གནས་སོ།
en: Words of the Forest “Great King, again, seeking supreme and complete awakening, I liberated flocks of beasts and birds from the fear of fire. Listen to that story. “Great King, once in the past there lived a great flock of birds in a deep forest that was beautified by hills, water, green grass, tree boughs, sāla trees, and palāśa trees.

source: །ཚལ་སྟུག་པོ་དེ་ན་ཡང་ཤིང་གཉིས་ཕན་ཚུན་འདྲུད་པས་མེ་བྱུང་བར་གྱུར་ཏོ།
en: Once in that dense forest two trees rubbed against each other, causing a fire.

source: །དེ་ན་བྱའི་ཚོགས་གང་དག་འཕུར་ནུས་པ་དེ་དག་ནི་དོང་ངོ་།
en: Flocks of birds that could fly flew away.

source: །འཕུར་མི་ནུས་པ་གང་ཡིན་པ་དང་། སྒོ་ང་རྣམས་ནི་དེ་ཉིད་དུ་བོར་རོ།
en: Those that could not fly, and eggs, were left there.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྲེག་པ་ཞིག་ཏུ་སྐྱེས་སོ།
en: At that time, the Bodhisattva had been born as a partridge.

source: །བྱང་ཆུབ་སེམས་དཔས་མེ་ཆེན་པོ་སྲེག་ཅིང་རྒྱང་རིང་པོ་ཁོ་ན་ནས་འོང་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་སེམས་ཅན་དེ་རྣམས་ལ་སྙིང་བརྩེ་བ་ཆེན་པོ་སྐྱེས་སོ།
en: When the Bodhisattva saw the large blazing fire approaching from a distance, he felt great compassion for the other beings.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་སོ། །བདག་གིས་སེམས་ཅན་སྡུག་བསྔལ་བར་གྱུར་པ་འདི་རྣམས་ཀྱི་དོན་ལ་བརྩོན་པར་མ་བྱས་ན་བདག་གསོན་ཏེ་ཡང་ཅི་རུང་། བདག་གིས་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཇི་ལྟར་བསྒྲལ་བར་བྱ་སྙམ་དུ་བསམས་ནས།
en: Thereupon the Bodhisattva thought, ‘What use would my life be if I did not make an effort for these beings in distress?

source: བྱང་ཆུབ་སེམས་དཔའི་འདབ་མ་ཆུས་གཤེར་བར་བྱས་ནས་མེའི་ཕུང་པོའི་སྟེང་གི་ནམ་མཁའ་ལ་འདུག་ནས་འདབ་མ་སྤྲུག་ཅིང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: I will liberate beings from transmigration.’ The Bodhisattva dampened his wings with his beak and remained hovering in the sky above the fire. Flapping his wings, he spoke these verses:

source: འདི་དག་འདབ་མ་ཡོད་མོད་ཀྱི།
en: “ ‘Although these ones have wings,

source: །འདི་དག་འཕུར་བར་མི་ནུས་སོ།
en: They cannot fly.

source: །འདི་དག་རྐང་པ་ཡོད་མོད་ཀྱི།
en: Although those ones have feet,

source: །འདི་དག་འགྲོ་བར་མི་ནུས་སོ།
en: They cannot walk.

source: །འདི་དག་ཕ་མ་འཕུར་ཏེ་དོང་།
en: Their parents have flown away.

source: །མེ་ནི་མ་གཡོ་བར་འདུག་ཤིག །བྱམས་པ་ཤིན་ཏུ་བསྒོམས་པ་ཡི།
en: May this fire not spread!

source: །བདེན་པའི་ཚིག་ནི་གང་ཡིན་པ།
en: “ ‘The truthful words Of one who practices love—

source: །མེ་ནི་མ་གཡོ་བར་འདུག་ཤིག །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ལ་ཕན་པར་བྱེད་པ་དེ་མཐོང་ངོ་།
en: May this fire not spread!’ “Śakra, Lord of the Gods, saw the Bodhisattva benefiting beings.

source: །མཐོང་ནས་ཀྱང་མི་དགའ་བར་གྱུར་ཏེ།
en: When he saw him, Śakra felt sad:

source: འདིས་བདག་ཉིད་ཡོངས་སུ་བཏང་བས་དེ་རྣམས་ལ་ཕན་པ་ཅི་ཞིག་ནུས།
en: ‘What benefit could this one do for them, even by sacrificing himself?

source: གཞན་ཡང་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་སེམས་ཅན་རྣམས་ལ་ཕན་པ་བྱེད་པ་ལ་སྐྱོ་བར་འགྱུར་གྱིས།
en: This bodhisattva of the fortunate eon will become discouraged about benefiting beings.

source: མ་ལ་བདག་གིས་འདིའི་གྲོགས་བྱའོ་སྙམ་ནས།
en: I will now help him.’

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཆར་ཆེན་པོ་རབ་ཏུ་ཕབ་པས་མེ་དེ་རབ་ཏུ་ཞི་བར་གྱུར་ཏེ།
en: “Śakra, Lord of the Gods, put out the fire by bringing a heavy rain.

source: དེས་ན་སེམས་ཅན་དེ་ཐམས་ཅད་མེའི་འཇིགས་པ་ལས་ཐར་བར་གྱུར་ཏོ།
en: Thus, all the beings were liberated from the fear of fire.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་སྲེག་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་དེ་ཡིན་ནོ།
en: It was me performing the practice of a bodhisattva who was the partridge at that time, on that occasion.

source: །རྒྱལ་པོ་ཆེན་པོ་དེས་ན་ངའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་སེམས་ཅན་ལ་ཕན་པ་བྱས་པ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening because I benefited beings by my practice of a bodhisattva, you should think otherwise;

source: འོན་ཀྱང་ངའི་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: that act of mine was only a cause, only a condition, only a preparation for supreme and complete awakening.” 6.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་སེམས་ཅན་ལ་ཕན་པ་བྱས་ཏེ་བློན་པོ་ལྔ་བརྒྱ་རང་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བ་རྒྱལ་སྲིད་བྱེད་དོ།
en: The Elephant “Great King, again I benefited beings and satisfied five hundred ministers with my own flesh and blood. Listen to that story. “Great King, once in the past, in the city of Vārāṇasī, a king named Brahmadatta was ruling over the country.

source: །དེའི་བློན་པོ་ལྔ་བརྒྱ་ཙམ་ཡོད་པ་ལས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་རྣམས་ཀྱིས་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཁ་ཕྱུང་བའི་གླེང་གཞི་དེ་དག་རྒྱལ་པོས་ཐོས་ནས།
en: He had five hundred ministers, but neighboring minor kings won over those five hundred ministers. The king heard of this matter.

source: རྒྱལ་པོ་དེ་ཡང་ཆོས་དང་ལྡན་པ་སྙིང་བརྩེ་བ་ཅན། ཆོས་འདོད་པ། སྐྱེ་བོ་ལ་འོ་བྱམས་པ། བདག་ལ་ཕན་པ་དང་། གཞན་ལ་ཕན་པར་ཞུགས་པ་ཞིག་པས་དེས་བསམས་པ། འདི་དག་བསད་དེ་ཅི་རུང་སྙམ་ནས་དེས་དེ་རྣམས་སྤྱུགས་ཏེ།
en: However, being righteous, compassionate, and eager for the Dharma, the king, who loved people and benefited himself and others, thought, ‘What is the use in killing them?’

source: དེ་རྣམས་སྨྱགས་བཅད་དེ་དོང་བ་ལས་བྱེ་གླིང་ཞིག་ལ་ཕྱིན་ཏོ།
en: “He banished them instead. They went away, and arrived fatigued at a sandy island.

source: །དེ་ན་དེ་རྣམས་སྐོམ་པས་ཉེན་ནས་ཕན་ཚུན་བརྟགས་ན་ཆུ་གང་ན་ཡང་མ་མཐོང་ནས།
en: They suffered from thirst there, and although each of them searched, they did not find any water anywhere, and they all wailed aloud.

source: དེ་རྣམས་ཀྱིས་མགྲིན་གཅིག་ཏུ་སྒྲ་ཕྱུང་བ་དང་། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གླང་པོ་ཆེ་རྣམས་ཀྱི་ནང་དུ་ཡན་ལག་བདུན་ལེགས་པར་གནས་པ་གླང་པོ་ཆེ་ས་སྲུང་གི་བུའི་ཤ་ཚུགས་ལྟ་བུ་ཞིག་ཏུ་སྐྱེས་པ་དེའི་བསོད་ནམས་ཀྱི་མཐུས་རི་སུལ་དག་མེ་ཏོག་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་ཤིང་རྫིང་དང་། མཚེའུ་དང་། ཆུ་འབབ་པ་དང་ལྡན་ནོ།
en: “At that time, the Bodhisattva had been born among elephants as an elephant whose body was well supported in its seven parts, and whose flesh was just like that of the elephant Airāvaṇa. By the power of his merit, there was a valley abundant in flowers and fruits, where there were lakes, ponds, and waterfalls.

source: །གླང་པོ་ཆེའི་གཙོ་བོ་དེས་ཐག་རིང་པོ་ན་གནས་བཞིན་དུ་ཚོར་ནས་དེས་སྣ་ཆུས་བཀང་ནས་བརྒྱུགས་ཏེ།
en: “Although he was at a distance, this leader of the elephants noticed those people.

source: དེས་བློན་པོ་དེ་རྣམས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་དབུགས་ཕྱུང་ནས་ཆུས་དེ་རྣམས་ཀྱི་ཁ་བཤལ་ཏེ་རྒྱབ་ཏུ་ཞོན་ནས་རི་སུལ་དེར་བཙུད་དེ།
en: He filled his trunk with water and ran over to where the ministers were.

source: འབྲས་བུ་དང་། རྩ་བ་དང་། ཆུས་ཚིམ་པར་བྱས་ཤིང་ལམ་གྱིས་དུབ་པ་བསལ་ནས།
en: He encouraged them, rinsed their mouths with water, put them on his back, took them to the valley, and satisfied them with fruits, roots, and water.

source: དེ་ནས་དེས་དེ་རྣམས་ལ་སྨྲས་པ། རི་སུལ་འདིའི་ཕ་རོལ་ངོས་ན་གླང་པོ་ཆེའི་གཙོ་བོའི་རོ་ཞིག་ཡོད་ཀྱིས།
en: After they were well rested, he said to them, ‘There is the dead body of the leader of the elephants beyond this valley.

source: དེའི་རྒྱུ་ལྟོ་ཁྲུས་ཏེ་ཆུས་ཁོང་ལ་རྩ་བ་དང་། འབྲས་བུ་དག་བསྡུས་ཏེ་དེང་ཤིག་དང་། དེ་ལྟར་ན་འབྲོག་འདི་རྟོལ་བར་འགྱུར་རོ།
en: Wash its intestines, fill them with water, collect roots and fruits, and proceed. In this way, you can pass through this highland.’

source: །དེ་སྐད་ཅེས་བསྟན་ནས་དེ་ནས་གླང་པོ་ཆེའི་གཙོ་བོ་དེ་རི་དེ་ལ་འཛེགས་ནས་སེམས་བསྐྱེད་སྨོན་ལམ་བཏབ་པ།
en: “Having thus instructed them, the leader of the elephants then climbed a mountain, made up his mind, and formed this aspiration:
